/*Дано число D и указатель P1 на вершину непустого стека.
Добавить элемент со значением D в стек и вывести адрес P2 новой вершины стека.

Для каждой динамической структуры должен быть предусмотрен стандартный набор методов -
добавления/удаления/вывода элементов.
Во всех задачах обязательно наличие дружественного интерфейса. Ввод данных с клавиатуры.

В заданиях подгруппы структура «стек» (stack) моделируется цепочкой связанных
узлов-записей типа TNode. Поле Next последнего элемента цепочки равно nullptr. Вершиной
стека (top) считается первый элемент цепочки. Для доступа к стеку используется указатель на
его вершину (для пустого стека данный указатель полагается равным nullptr). Значением
элемента стека считается значение его поля Data*/

/*Общие изменения:
FixME: Весь код имеет отступы в 4 пробела и лишние пробелы с абзацами.
Весь код переделан на отступы в 2 пробела настройками среды.

FixME: Комментарии кода не отвечают на вопрос "Почему" и располагаются рядом с кодом".
Комментарии внутри кода переделаны на вопрос "Почему."
Комментарии внутри кода объясняющие понятную логику были удалены.

FixME: endl замедляет программу.
Все "endl" в коде заменены на "\n".

FixME: Нет логического деления в некоторых частях кода - switch (в case).
FixME: Нет модульного представления программы.*/

#include <iostream>
#include <locale.h>
#include "Stack.h"
#include <windows.h> 

/*FixME: using namespace std запрещён
using namespace std;
Во всём коде исправлена эта ошибка*/

int main() {
  setlocale(LC_ALL, "Russian");
  SetConsoleOutputCP(65001);
  SetConsoleCP(65001);
  system("chcp 65001 > nul");
  Stack stack;

  /*FixME: Отсутствие инициализации переменных и объявление в одной строке .
  int choice, value;{*/
  int choice = 0;
  int value = 0;

  while (true) {
    std::cout << "\nМеню:\n"
      /*FixME: Присутствуют лишние "cout".
      cout << "1. Добавить элемент в стек\n";
      cout << "2. Удалить элемент из стека\n";
      cout << "3. Вывести элементы стека\n";
      cout << "4. Очистить стек\n";
      cout << "5. Выйти\n";
      cout << "Введите ваш выбор: ";
      cin >> choice;{*/
      << "1. Добавить элемент в стек\n"
      << "2. Удалить элемент из стека\n"
      << "3. Вывести элементы стека\n"
      << "4. Очистить стек\n"
      << "5. Выйти\n"
      << "Введите ваш выбор: ";

    std::cin >> choice;

    switch (choice) {
    case 1:
      std::cout << "Введите число для добавления в стек: ";
      std::cin >> value;
      addElementAndPrintAddress(stack, value);
      break;

    case 2:
      stack.pop();
      break;

    case 3:
      stack.print();
      break;

    case 4:
      stack.clear();
      break;

    case 5:
      std::cout << "Выход из программы.\n";
      return 0;

    default:
      std::cout << "Неверный выбор! Пожалуйста, попробуйте снова.\n";
    }
  }

  /*FixME: return не требуется.
  return 0; */
}
