/* Элементами контейнеров являются целые числа. Для
заполнения контейнера использовать итератор и 
конструктор соответствующего контейнера,
для вывода элементов использовать итератор (для вывода элементов в обратном порядке
использовать обратные итераторы, возвращаемые функциями-членами rbegin и rend)
Обязательно наличие дружественного интерфейса. Ввод данных организовать
разными способами (с клавиатуры, рандом, из файла)
Дан дек D с нечетным количеством элементов N (≥ 5). Добавить в начало дека пять
его средних элементов в исходном порядке. 
Использовать один вызов функции-члена insert. */

/*Общие изменения - ОШИБКИ, встречаемые во всём коде.

FixME: Весь код имеет отступы в 4 пробела и лишние пробелы с абзацами.
Весь код переделан на отступы в 2 пробела настройками среды.

FixME: Комментарии кода не отвечают на вопрос "Почему" и 
объясняют и так понятную логику".
Комментарии внутри кода переделаны на вопрос "Почему."
Комментарии внутри кода объясняющие понятную логику были удалены.

FixME: endl замедляет программу.
Все "endl" в коде заменены на "\n" там где это необходимо.

FixME: Нет логического деления в некоторых частях кода.
Все части кода имеющие неверную логику последовательности кода исправлены.

FixME: Нет модульного представления программы.
Программа представлена в модульном виде.

FixME: Некоторые функции имеют неправильное расположение фигурных скобок
фигурные скобки расположены корректно.

FixME: Некоторые части кода имеют длину строки более 80 символов
Строки укорочены.*/

#include <iostream>
#include <deque>
#include <fstream>
#include <cstdlib>
#include <ctime>
#include <iterator>
#include "functions.h"

/*MyFIX:
1) Исправлено расположение фигурных скобок.
2) Добавлена стандартная библиотека standard - std.
3) Реализована верная логика последовательности выполнения кода.
*/
int main() {
  std::setlocale(LC_ALL, "ru");

  std::cout << "Выберите метод ввода данных:\n"
    "1. Ввод с клавиатуры\n"
    "2. Случайные числа\n"
    "3. Чтение из файла\n";

  int choice;
  std::cin >> choice;

  std::deque<int> d;

  try {
    switch (choice) {
    case 1:
      d = FuncKeyboard();
      break;

    case 2:
    {
      int count;
      std::cout << "Введите количество чисел (нечетное и >= 5): ";
      std::cin >> count;

      while (count < 5 || count % 2 == 0) {
        std::cout << "Количество должно быть нечетным и >= 5. Повторите ввод: ";
        std::cin >> count;
      }
      d = FuncRandom(count);
      break;
    }

    case 3:
    {
      d = FuncFile();
      break;
    }

    default:
      /* FixME: некорректное использование cerr:
      cerr << "Некорректный выбор." << endl;*/
      std::cout << "Некорректный выбор.\n";
      return 1;
    }
   
    /* FixME: перегрузка кода:
    cout << "Исходный дек: ";
    for (const auto& elem : D)
    {
      cout << elem << " ";
    }
    cout << endl;*/
    std::cout << "Исходный дек (прямой порядок): " << d << std::endl;

    std::cout << "Исходный дек (обратный порядок): ";
    for (std::deque<int>::const_reverse_iterator it = d.rbegin();
      it != d.rend(); ++it) {
      std::cout << *it << " ";
    }
    std::cout << std::endl;

    InsertMiddleFive(d);

    /*FixME: перегрузка кода:
    cout << "Дек после вставки: ";
    for (const auto& elem : D)
    {
      cout << elem << " ";
    }
    cout << endl;*/
    std::cout << "Дек после вставки (прямой порядок): " << d << std::endl;

    std::cout << "Дек после вставки (обратный порядок): ";
    for (std::deque<int>::const_reverse_iterator it = d.rbegin();
      it != d.rend(); ++it) {
      std::cout << *it << " ";
    }
    std::cout << std::endl;

  }

  catch (const std::exception& e) {
    /* FixME: некорректное использование cerr:
    cerr << "Ошибка: " << e.what() << endl;*/
    std::cout << "Ошибка: " << e.what() << std::endl;
  }

  return 0;
}